/*
# Level 100:

# 1. ტექსტური სახით დაწერეთ მოგეწონათ თუ არა 'Whiplash '? რატომ ან რატომ არა? .
მომეწონა 'Whiplash', რადგან ფილმი ძალიან ემოციური და შთამბეჭდავია. მსახიობების შესრულება და მუსიკალური სცენები განსაკუთრებულად მომეწონა.

# 2. ტექსტური სახით დაწერეთ თუ რას შეცვლიდით 'Whiplash ' - ში.
'Whiplash'-ში შევცვლიდი ფილმის დასასრულს, რათა უფრო ნათელი და პოზიტიური ყოფილიყო. ასევე, უფრო მეტი ყურადღება მივაქცევდი მეორეხარისხოვან პერსონაჟებს.

# 3. ტექსტური სახით დაწერეთ თუ რა შთაბეჭდილებები დაგიტოვათ 'Whiplash ' - მა.
'Whiplash'-მა დამიტოვა შთაბეჭდილება, რომ მიზნის მისაღწევად საჭიროა დიდი შრომა და თავდადება. ფილმმა ასევე დამაფიქრა მასწავლებლისა და მოსწავლის ურთიერთობაზე და იმ ზეწოლაზე, რაც შეიძლება მათ შორის არსებობდეს.
*/